#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.gke_project.google_project.main will be created
+ resource "google_project" "main" {
      + app_engine          = (known after apply)
      + auto_create_network = true
      + billing_account     = "017A87-D72085-E6948F"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "environment"       = "production"
          + "purpose"           = "GKE"
          + "team"              = "sander"
          + "terraform_managed" = "true"
        }
      + name                = "GKE Project"
      + number              = (known after apply)
      + org_id              = "173736554255"
      + policy_data         = (known after apply)
      + policy_etag         = (known after apply)
      + project_id          = "sander-gke-project"
      + skip_delete         = (known after apply)
    }

  # module.gke_project.google_project_iam_member.main will be created
+ resource "google_project_iam_member" "main" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:sander-fearnley-hvas@darknet.fyi"
      + project = (known after apply)
      + role    = "roles/owner"
    }

  # module.gke_project.google_project_service.project_services["compute.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "sander-gke-project"
      + service                    = "compute.googleapis.com"
    }

  # module.gke_project.google_project_service.project_services["iam.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "sander-gke-project"
      + service                    = "iam.googleapis.com"
    }

  # module.gke_project.google_project_service.project_services["iamcredentials.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "sander-gke-project"
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.gke_project.google_project_service.project_services["storage-api.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "sander-gke-project"
      + service                    = "storage-api.googleapis.com"
    }

  # module.gke_project.google_project_service.project_services["storage-component.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "sander-gke-project"
      + service                    = "storage-component.googleapis.com"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform`, Action: `hashicorpterraform-github-actions4`*